//Инициализация карты
export const init = () => {
    const map = new window.ymaps.Map("map", {
        center: [48.284219, 38.817179], //центр карты
        zoom: 12,                       //зум от 0 до 19
    }, {
        suppressMapOpenBlock: true      //убирает надпись "Как добраться"
    });

    //Указатель на офис
    const placemark = new window.ymaps.Placemark([48.284219, 38.817179], {
        iconContent: 'Карьер ЛСК',
        balloonContent: 'пос. Ковыльное, ул. Пролетарская, 38'
    }, {
        preset: 'twirl#blueStretchyIcon'    //тип и параметры указателя
    });

    //полигон карьера
    const polygon = new window.ymaps.Polygon([[
            [48.284445882, 38.805558086],
            [48.286112548, 38.805835864],
            [48.287501437, 38.808891420],
            [48.287501437, 38.811113642],
            [48.288612548, 38.813613642],
            [48.288334770, 38.820002531],
            [48.287779215, 38.822780309],
            [48.285001437, 38.823058087],
            [48.285556993, 38.817224753],
            [48.284168104, 38.808058086],
            [48.284445882, 38.805558086],
        ]],
        {}, //здесь можно сделать надпись внутри полигона
        {
            fillColor: '#00ff0088',     //цвет полигона
            strokeColor: '#0000ff',     //цвет границы полигона
            strokeWidth: 5,             //толщина границы
            strokeStyle: 'shortdash'    //тип линии границы
        }
    );

    map.geoObjects.add(polygon); // добавить границу карьера

    map.geoObjects.add(placemark); // добавить указатель на офис

    map.behaviors.enable('scrollZoom'); //включить скрол
};