export const aboutCompany =[
    "ООО «ЛСК» – это промышленное предприятие, которое существует более 18 лет. Основной вид деятельности компании - разработка гравийных и песчаных карьеров, добыча глины и каолина. Конкурентное преимущество ООО «ЛСК» перед другими производителями в том, что качество производимого щебня соответствует марке М1200 (высокопрочный щебень).",
    "Основные типы производимой продукции – щебень фракций: 5-10, 10-20, 5-20, 20- 40, 40-70, 4-8, 8-16, 16-22,4 мм., щебеночно-песчаная смесь и песок из отсевов дробления.",
]